ad_logs/ab_dynamic_cached.log
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        nginx/1.6.2
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /question/hello/?a=1&b=2&c=3
Document Length:        69 bytes

Concurrency Level:      10
Time taken for tests:   0.161 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      229000 bytes
HTML transferred:       69000 bytes
Requests per second:    6198.13 [#/sec] (mean)
Time per request:       1.613 [ms] (mean)
Time per request:       0.161 [ms] (mean, across all concurrent requests)
Transfer rate:          1386.11 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     0    1   3.7      1      38
Waiting:        0    1   3.7      1      38
Total:          1    2   3.8      1      39

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      3
  98%      8
  99%     36
 100%     39 (longest request)